import {minify} from "../repositories/resultsRepository.js";
import {clone} from "../common/utils.js";

export default class MockResultsRepository {
    #data

    constructor() {
        this.reset();
    }

    reset = () => this.#data = this.#initialData();

    #initialData = () => clone(mockResults).map(p => minify(p));

    getByTournamentAndTour = (tournament, tour) => Promise
        .resolve(this.getByTournamentAndTourDirect(tournament, tour))

    getByTournamentAndTourDirect = (tournament, tour) =>
        this.#data.filter(r => r.tournament === tournament && r.tour === tour)

    getByTournament = tournament => Promise.resolve(this.getByTournamentDirect(tournament));

    getByTournamentDirect = tournament => this.#data.filter(r => r.tournament === tournament).map(r => clone(r));

    getGroup = (group, tour = 1, tournament = 'recTBtRUiBwh3avjf') => this.#data
        .filter(r => r.group === group && r.tour === tour && r.tournament === tournament)
        .map(r => clone(r))

    getGroups = (groups, tour = 1, tournament = 'recTBtRUiBwh3avjf') => this.#data
        .filter(r => r.tour === tour && r.tournament === tournament)
        .filter(r => groups.includes(r.group))
        .map(r => clone(r))
}

const mockResults =
    [
        {
            "id": "recpQUhZgyAOlGAWd",
            "createdTime": "2023-02-19T16:49:58.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "четвертьфинал",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Результат": "2:0 (25:23, 25:15)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, четвертьфинал: Спарта - Продвижение 2:0 (25:23, 25:15)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Спарта - Продвижение 2:0 (25:23, 25:15)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "rec3TRE6LlY0L7qJt",
            "createdTime": "2023-02-19T16:49:59.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "четвертьфинал",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:0 (25:23, 26:24)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, четвертьфинал: Матчбол - Сурож 2:0 (25:23, 26:24)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Матчбол - Сурож 2:0 (25:23, 26:24)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "recTb2BZAjXqL4qHU",
            "createdTime": "2023-02-19T16:49:59.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "за 5 место",
                "Команда-победитель": [
                    "rectlFHt9jokhoEon"
                ],
                "Команда-проигравший": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Результат": "2:1 (27:25, 23:25, 15:10)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, за 5 место: Сурож - Продвижение 2:1 (27:25, 23:25, 15:10)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Сурож - Продвижение 2:1 (27:25, 23:25, 15:10)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "rec8Lqw2QheAiCjGl",
            "createdTime": "2023-02-19T16:49:59.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "полуфинал",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "recV5nUenQAEGrXcU"
                ],
                "Результат": "2:0 (25:20, 25:15)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, полуфинал: Кристалл - Спарта 2:0 (25:20, 25:15)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Кристалл - Спарта 2:0 (25:20, 25:15)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "recrA6qwTiphtu0To",
            "createdTime": "2023-02-19T16:50:00.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "полуфинал",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "recBpK5dYCD9rugER"
                ],
                "Результат": "2:1 (25:18, 25:27, 15:12)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, полуфинал: Матчбол - Черноморец 2:1 (25:18, 25:27, 15:12)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Матчбол - Черноморец 2:1 (25:18, 25:27, 15:12)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "recsH9Qw8G8uAzLgU",
            "createdTime": "2023-02-19T16:50:00.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "за 3 место",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recV5nUenQAEGrXcU"
                ],
                "Результат": "2:1 (25:22, 25:20, 16:14)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, за 3 место: Черноморец - Спарта 2:1 (25:22, 25:20, 16:14)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Черноморец - Спарта 2:1 (25:22, 25:20, 16:14)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "rec2aBIucydYdSfp5",
            "createdTime": "2023-02-19T16:50:00.000Z",
            "fields": {
                "Турнир link": [
                    "recJepQzq0sgvQsko"
                ],
                "Группа": "финал",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Результат": "2:0 (25:18, 25:19)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2023, финал: Кристалл - Матчбол 2:0 (25:18, 25:19)",
                "Турнир": [
                    "23.2 Весна 2023"
                ],
                "Результат полностью": "Кристалл - Матчбол 2:0 (25:18, 25:19)",
                "ID турнира": [
                    "recJepQzq0sgvQsko"
                ]
            }
        },
        {
            "id": "recnxofhI6R4jSBAf",
            "createdTime": "2022-10-05T06:02:30.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recyc7DIoPv1Z85o5",
            "createdTime": "2022-10-05T06:02:29.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recLW0onj7PBJx0BC",
            "createdTime": "2022-10-05T06:02:28.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "reccO2eTQ9F2q2QMe",
            "createdTime": "2022-09-05T08:02:21.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "2:0 (25:21, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Спарта - Легион-2 2:0 (25:21, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Спарта - Легион-2 2:0 (25:21, 25:21)"
            }
        },
        {
            "id": "recm91ImMEe490Hem",
            "createdTime": "2022-09-05T08:02:22.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recf5jCoQc4ebLckG"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "2:1 (25:18, 20:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Мстители - Легион-2 2:1 (25:18, 20:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Мстители - Легион-2 2:1 (25:18, 20:25, 15:12)"
            }
        },
        {
            "id": "recJWTWWABYKglu1l",
            "createdTime": "2022-09-05T08:02:23.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "recf5jCoQc4ebLckG"
                ],
                "Результат": "2:1 (25:19, 23:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Спарта - Мстители 2:1 (25:19, 23:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Спарта - Мстители 2:1 (25:19, 23:25, 15:10)"
            }
        },
        {
            "id": "recgigCvlhm4ex65d",
            "createdTime": "2022-09-05T08:02:19.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Результат": "2:1 (25:15, 25:27, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Легион - Матчбол 2:1 (25:15, 25:27, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Легион - Матчбол 2:1 (25:15, 25:27, 15:12)"
            }
        },
        {
            "id": "reci4Qhl8CZwLsvZV",
            "createdTime": "2022-09-05T08:02:20.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:0 (25:11, 25:17)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Легион - Сурож 2:0 (25:11, 25:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Легион - Сурож 2:0 (25:11, 25:17)"
            }
        },
        {
            "id": "rechWVrekFl3VX9zt",
            "createdTime": "2022-09-05T08:02:21.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:1 (22:25, 25:19, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Матчбол - Сурож 2:1 (22:25, 25:19, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Матчбол - Сурож 2:1 (22:25, 25:19, 15:10)"
            }
        },
        {
            "id": "rec16LiUR8p2LTJN7",
            "createdTime": "2022-09-04T19:06:35.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:1 (25:18, 23:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Черноморец - Бастион 2:1 (25:18, 23:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец - Бастион 2:1 (25:18, 23:25, 15:10)"
            }
        },
        {
            "id": "recLmyvXm8OqY2OAG",
            "createdTime": "2022-09-04T19:06:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:20, 26:24)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Черноморец - ЧНГ 2:0 (25:20, 26:24)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец - ЧНГ 2:0 (25:20, 26:24)"
            }
        },
        {
            "id": "recgZYGgMvDc13jRr",
            "createdTime": "2022-09-04T19:06:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recQCcUcWqfasbeAr"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:20, 25:15)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Бастион - ЧНГ 2:0 (25:20, 25:15)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Бастион - ЧНГ 2:0 (25:20, 25:15)"
            }
        },
        {
            "id": "recyU2CI3Z2xqUSvz",
            "createdTime": "2022-09-05T08:02:40.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recnEELXiDFrxIPix"
                ],
                "Команда-проигравший": [
                    "recst39AJwl7Edi0c"
                ],
                "Результат": "2:0 (27:25, 25:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Алушта - Комус 2:0 (27:25, 25:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Алушта - Комус 2:0 (27:25, 25:20)"
            }
        },
        {
            "id": "recHNJU5R45MUcaAm",
            "createdTime": "2022-09-05T08:02:41.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recst39AJwl7Edi0c"
                ],
                "Команда-проигравший": [
                    "recDxakzIGaFzydAA"
                ],
                "Результат": "2:1 (14:25, 25:21, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Комус - Импульс 2:1 (14:25, 25:21, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Комус - Импульс 2:1 (14:25, 25:21, 15:13)"
            }
        },
        {
            "id": "recA53vyql8U3ykTk",
            "createdTime": "2022-09-05T08:02:41.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recDxakzIGaFzydAA"
                ],
                "Команда-проигравший": [
                    "recnEELXiDFrxIPix"
                ],
                "Результат": "2:1 (19:25, 27:25, 17:15)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Импульс - Алушта 2:1 (19:25, 27:25, 17:15)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Импульс - Алушта 2:1 (19:25, 27:25, 17:15)"
            }
        },
        {
            "id": "rec6t1t7DDPNehWgw",
            "createdTime": "2022-09-05T08:02:37.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "2:1 (25:18, 21:25, 18:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Феникс - Ахтиар 2:1 (25:18, 21:25, 18:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Феникс - Ахтиар 2:1 (25:18, 21:25, 18:16)"
            }
        },
        {
            "id": "recyx0nEOoyQKNibm",
            "createdTime": "2022-09-05T08:02:38.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recyw2f145WAJGLGx"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:0 (25:19, 25:22)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Медведи - Феникс 2:0 (25:19, 25:22)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Медведи - Феникс 2:0 (25:19, 25:22)"
            }
        },
        {
            "id": "recgoBwtqudHz4X1E",
            "createdTime": "2022-09-05T08:02:39.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recyw2f145WAJGLGx"
                ],
                "Результат": "2:0 (27:25, 25:18)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Ахтиар - Медведи 2:0 (27:25, 25:18)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ахтиар - Медведи 2:0 (27:25, 25:18)"
            }
        },
        {
            "id": "recennXF3kBU53a9j",
            "createdTime": "2022-09-05T08:02:34.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:1 (24:26, 25:16, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: Рейнджерс - Оникс 2:1 (24:26, 25:16, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Рейнджерс - Оникс 2:1 (24:26, 25:16, 15:13)"
            }
        },
        {
            "id": "rec6sTDWV7d5VWx4D",
            "createdTime": "2022-09-05T08:02:35.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Команда-проигравший": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Результат": "2:1 (25:19, 22:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: Рейнджерс - ЮБК 2:1 (25:19, 22:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Рейнджерс - ЮБК 2:1 (25:19, 22:25, 15:10)"
            }
        },
        {
            "id": "recOwB9qn8DBSnpKH",
            "createdTime": "2022-09-05T08:02:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:1 (25:22, 21:25, 15:9)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: ЮБК - Оникс 2:1 (25:22, 21:25, 15:9)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ЮБК - Оникс 2:1 (25:22, 21:25, 15:9)"
            }
        },
        {
            "id": "recSZRCdzXxxda5Pp",
            "createdTime": "2022-09-05T08:02:31.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Результат": "2:0 (25:21, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Продвижение - Черноморец-2 2:0 (25:21, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - Черноморец-2 2:0 (25:21, 25:19)"
            }
        },
        {
            "id": "recLwnDmjxZcFyM34",
            "createdTime": "2022-09-05T08:02:32.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Команда-проигравший": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Результат": "2:0 (25:23, 25:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Заря Крыма - Черноморец-2 2:0 (25:23, 25:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Заря Крыма - Черноморец-2 2:0 (25:23, 25:20)"
            }
        },
        {
            "id": "recqBc8IcLjBL4PHe",
            "createdTime": "2022-09-05T08:02:33.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Результат": "2:1 (21:25, 25:17, 15:11)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Продвижение - Заря Крыма 2:1 (21:25, 25:17, 15:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - Заря Крыма 2:1 (21:25, 25:17, 15:11)"
            }
        },
        {
            "id": "recyIE1hjHJt9fnU4",
            "createdTime": "2022-09-04T19:06:32.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Команда-проигравший": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Результат": "2:0 (25:17, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Ралли-поинт - Циркон 2:0 (25:17, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ралли-поинт - Циркон 2:0 (25:17, 25:19)"
            }
        },
        {
            "id": "recQgoNjPa2oBZFKY",
            "createdTime": "2022-09-04T19:06:33.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Результат": "2:0 (25:20, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Лукулл - Циркон 2:0 (25:20, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Циркон 2:0 (25:20, 25:16)"
            }
        },
        {
            "id": "reczXMPXXcA7Itycp",
            "createdTime": "2022-09-04T19:06:34.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Результат": "2:0 (25:19, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Лукулл - Ралли-поинт 2:0 (25:19, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Ралли-поинт 2:0 (25:19, 25:19)"
            }
        },
        {
            "id": "recBrXOPNEFlaEgMS",
            "createdTime": "2022-09-05T08:02:58.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "recuchsORYh1p8mL5"
                ],
                "Результат": "2:0 (25:21, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Астра - Крафт 2:0 (25:21, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Астра - Крафт 2:0 (25:21, 25:16)"
            }
        },
        {
            "id": "rechP6ldKv2tQFY3F",
            "createdTime": "2022-09-05T08:02:59.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recVLMP36y7NzwTFk"
                ],
                "Команда-проигравший": [
                    "recuchsORYh1p8mL5"
                ],
                "Результат": "2:0 (25:22, 26:24)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Таврия - Крафт 2:0 (25:22, 26:24)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Таврия - Крафт 2:0 (25:22, 26:24)"
            }
        },
        {
            "id": "recnDuXCXopiG83ao",
            "createdTime": "2022-09-05T08:03:00.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "recVLMP36y7NzwTFk"
                ],
                "Результат": "2:0 (25:16, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Астра - Таврия 2:0 (25:16, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Астра - Таврия 2:0 (25:16, 25:19)"
            }
        },
        {
            "id": "recClm0hl6L2wI4E4",
            "createdTime": "2022-09-05T08:02:56.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recmIPtfETs7wIh6N"
                ],
                "Команда-проигравший": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Результат": "2:0 (25:14, 25:17)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Дивизион - Молния 2:0 (25:14, 25:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Дивизион - Молния 2:0 (25:14, 25:17)"
            }
        },
        {
            "id": "recDAMjiQELaWttDj",
            "createdTime": "2022-09-05T08:02:56.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Команда-проигравший": [
                    "recWxZUi2wubRzEsb"
                ],
                "Результат": "2:1 (25:10, 17:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Молния - Динамит 2:1 (25:10, 17:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Молния - Динамит 2:1 (25:10, 17:25, 15:10)"
            }
        },
        {
            "id": "recEyXi0HXCj0nqJB",
            "createdTime": "2022-09-05T08:02:57.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recmIPtfETs7wIh6N"
                ],
                "Команда-проигравший": [
                    "recWxZUi2wubRzEsb"
                ],
                "Результат": "2:1 (26:24, 20:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Дивизион - Динамит 2:1 (26:24, 20:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Дивизион - Динамит 2:1 (26:24, 20:25, 15:12)"
            }
        },
        {
            "id": "recvCwyemBB4Z8iSP",
            "createdTime": "2022-09-05T08:02:54.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Команда-победитель": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Команда-проигравший": [
                    "recoWmhWBQWh2jzRL"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа K: Коралл - ФВМ+1 +:- (неявка)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Коралл - ФВМ+1 +:- (неявка)"
            }
        },
        {
            "id": "rec2bk4kHqBT7JOxH",
            "createdTime": "2022-09-05T08:02:55.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Команда-победитель": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Команда-проигравший": [
                    "rec9HmVM1YlrsaUR6"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа K: Коралл - Хром +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Коралл - Хром +:- (снятие)"
            }
        },
        {
            "id": "recDYnTKWiiRCikzv",
            "createdTime": "2022-09-05T08:02:50.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recMYX0UQ505TwwQL"
                ],
                "Команда-проигравший": [
                    "reccEe7SloEGYhD9e"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Стрела - Штурм +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Стрела - Штурм +:- (снятие)"
            }
        },
        {
            "id": "reczwoax8xxGAMvOI",
            "createdTime": "2022-09-05T08:02:51.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "reccEe7SloEGYhD9e"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Карасуно - Штурм +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Карасуно - Штурм +:- (снятие)"
            }
        },
        {
            "id": "reckL9GpAvJyJKBqw",
            "createdTime": "2022-09-05T08:02:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "recMYX0UQ505TwwQL"
                ],
                "Результат": "3:1 (25:20, 20:25, 25:18, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Карасуно - Стрела 3:1 (25:20, 20:25, 25:18, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Карасуно - Стрела 3:1 (25:20, 20:25, 25:18, 25:21)"
            }
        },
        {
            "id": "rec1E0nhgy1oUduJ0",
            "createdTime": "2022-08-27T20:35:51.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Команда-проигравший": [
                    "reche4L2VLav89gU5"
                ],
                "Результат": "2:0 (25:17, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Сплин - Некома 2:0 (25:17, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Сплин - Некома 2:0 (25:17, 25:21)"
            }
        },
        {
            "id": "recbKnIxiqukTdQtk",
            "createdTime": "2022-08-27T20:35:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Команда-проигравший": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Результат": "2:0 (25:17, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Омега - Сплин 2:0 (25:17, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Омега - Сплин 2:0 (25:17, 25:21)"
            }
        },
        {
            "id": "recGGMXyg7sOZhYIL",
            "createdTime": "2022-08-27T20:35:53.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Команда-проигравший": [
                    "reche4L2VLav89gU5"
                ],
                "Результат": "2:0 (25:12, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Омега - Некома 2:0 (25:12, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Омега - Некома 2:0 (25:12, 25:19)"
            }
        },
        {
            "id": "rec3ObcECKAeyDVjE",
            "createdTime": "2022-09-05T08:03:09.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Команда-проигравший": [
                    "recwRIDRji0gaA92X"
                ],
                "Результат": "3:1 (25:14, 25:16, 20:25, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Барс - Домино 3:1 (25:14, 25:16, 20:25, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Барс - Домино 3:1 (25:14, 25:16, 20:25, 25:16)"
            }
        },
        {
            "id": "rec9QmNCp9ByVl636",
            "createdTime": "2022-09-05T08:03:10.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Результат": "2:0 (25:23, 25:11)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Атом - Барс 2:0 (25:23, 25:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Барс 2:0 (25:23, 25:11)"
            }
        },
        {
            "id": "recKpX0XiZxvV3FBd",
            "createdTime": "2022-09-05T08:03:11.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recwRIDRji0gaA92X"
                ],
                "Результат": "2:0 (25:7, 25:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Атом - Домино 2:0 (25:7, 25:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Домино 2:0 (25:7, 25:12)"
            }
        },
        {
            "id": "recZux0gk1o9p7mcy",
            "createdTime": "2022-09-05T08:03:06.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "rec9GbvD9xEOe7ksG"
                ],
                "Команда-проигравший": [
                    "rec7IAXxfzLtdhMsg"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Энель - Карма +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Энель - Карма +:- (снятие)"
            }
        },
        {
            "id": "recZsFRLDko9j8U23",
            "createdTime": "2022-09-05T08:03:07.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Команда-проигравший": [
                    "rec7IAXxfzLtdhMsg"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Черноморец-3 - Карма +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-3 - Карма +:- (снятие)"
            }
        },
        {
            "id": "recBWVGqJpveh0QO4",
            "createdTime": "2022-09-05T08:03:08.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Команда-проигравший": [
                    "rec9GbvD9xEOe7ksG"
                ],
                "Результат": "3:2 (25:20, 25:14, 18:25, 22:25, 22:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Черноморец-3 - Энель 3:2 (25:20, 25:14, 18:25, 22:25, 22:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-3 - Энель 3:2 (25:20, 25:14, 18:25, 22:25, 22:20)"
            }
        },
        {
            "id": "recLqvctrsE47Mcek",
            "createdTime": "2022-09-04T19:06:29.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recrlWD64QAqzpZ9O"
                ],
                "Результат": "2:1 (25:15, 23:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: Шторм - ЭкоПик 2:1 (25:15, 23:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Шторм - ЭкоПик 2:1 (25:15, 23:25, 15:12)"
            }
        },
        {
            "id": "recqh4YVzzVJGzlnp",
            "createdTime": "2022-09-04T19:06:30.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "recrlWD64QAqzpZ9O"
                ],
                "Команда-проигравший": [
                    "recc8PkfQSTRuAKZg"
                ],
                "Результат": "2:0 (25:20, 25:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: ЭкоПик - Ортус 2:0 (25:20, 25:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ЭкоПик - Ортус 2:0 (25:20, 25:13)"
            }
        },
        {
            "id": "recMgwoW8c5vZh5cB",
            "createdTime": "2022-09-04T19:06:31.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recc8PkfQSTRuAKZg"
                ],
                "Результат": "2:0 (25:11, 25:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: Шторм - Ортус 2:0 (25:11, 25:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Шторм - Ортус 2:0 (25:11, 25:10)"
            }
        },
        {
            "id": "recNXkKxfsDoPLCSQ",
            "createdTime": "2022-10-14T21:21:18.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - Аленка и компания -:- (неявка)",
                "Результат полностью": " - Аленка и компания -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "recrnpNtzebiv8cC7"
                ],
                "Результат": "-:- (неявка)"
            }
        },
        {
            "id": "recr0ePfvCOOdqxEo",
            "createdTime": "2022-10-14T21:21:20.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - Акулки -:- (неявка)",
                "Результат полностью": " - Акулки -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "recOD3widNtopWjf7"
                ],
                "Результат": "-:- (неявка)"
            }
        },
        {
            "id": "reczo7IrTvGW5dFPd",
            "createdTime": "2022-10-14T21:21:21.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - 17м/с -:- (неявка)",
                "Результат полностью": " - 17м/с -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "reczIrCoCxiUr3LnJ"
                ],
                "Результат": "-:- (неявка)"
            }
        },
        {
            "id": "rec4QJF6b1VCAtlM7",
            "createdTime": "2022-10-05T06:02:38.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа A:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recDHhP3HnNuWaan8",
            "createdTime": "2022-10-05T06:03:01.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа A:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recQFonXzQFKNyaq4",
            "createdTime": "2022-10-05T06:02:58.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа A:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recLCaxIfkzoaOsmK",
            "createdTime": "2022-10-05T06:02:37.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа B:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recXkKpmEc2HuGWCw",
            "createdTime": "2022-10-05T06:02:35.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа B:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "reczDZCwhJlE2gohj",
            "createdTime": "2022-10-05T06:02:34.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа B:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recnxofhI6R4jSBAf",
            "createdTime": "2022-10-05T06:02:30.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recyc7DIoPv1Z85o5",
            "createdTime": "2022-10-05T06:02:29.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recLW0onj7PBJx0BC",
            "createdTime": "2022-10-05T06:02:28.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа C:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recQiN5rPIfz6j47t",
            "createdTime": "2022-10-05T06:02:27.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recDxakzIGaFzydAA"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:22, 25:22)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа D: Импульс - ЧНГ 2:0 (25:22, 25:22)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Импульс - ЧНГ 2:0 (25:22, 25:22)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recTqe50ueTER1oYM",
            "createdTime": "2022-10-05T06:02:26.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recDxakzIGaFzydAA"
                ],
                "Результат": "2:1 (23:25, 25:23, 15:13)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа D: Ахтиар - Импульс 2:1 (23:25, 25:23, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ахтиар - Импульс 2:1 (23:25, 25:23, 15:13)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rechvxe2mx78PTBor",
            "createdTime": "2022-10-05T06:02:25.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:1 (25:23, 18:25, 15:13)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа D: Ахтиар - ЧНГ 2:1 (25:23, 18:25, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ахтиар - ЧНГ 2:1 (25:23, 18:25, 15:13)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rectMVkrQfW6rMndZ",
            "createdTime": "2022-10-05T06:02:24.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа E:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recJ3MEGRuCZRcxFG",
            "createdTime": "2022-10-05T06:02:03.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа E:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec2XTdcijmPQ9D1V",
            "createdTime": "2022-10-05T06:02:23.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа E:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recC925jd1m17Ueut",
            "createdTime": "2022-10-05T06:02:02.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Результат": "2:0 (26:24, 25:19)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа F: Продвижение - ЮБК 2:0 (26:24, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - ЮБК 2:0 (26:24, 25:19)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recV07lZ4hyx4gsmN",
            "createdTime": "2022-10-05T06:02:01.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:0 (25:15, 25:22)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа F: Продвижение - Феникс 2:0 (25:15, 25:22)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - Феникс 2:0 (25:15, 25:22)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recM0fe2eZCNkJ762",
            "createdTime": "2022-10-05T06:01:59.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:1 (18:25, 28:26, 15:10)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа F: ЮБК - Феникс 2:1 (18:25, 28:26, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ЮБК - Феникс 2:1 (18:25, 28:26, 15:10)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recVLB92SN0Gseyor",
            "createdTime": "2022-10-05T06:01:58.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:0 (25:19, 25:21)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа G: Лукулл - Оникс 2:0 (25:19, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Оникс 2:0 (25:19, 25:21)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recxm3hvSbJzWtAyK",
            "createdTime": "2022-10-05T06:01:57.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:0 (25:22, 25:11)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа G: Заря Крыма - Оникс 2:0 (25:22, 25:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Заря Крыма - Оникс 2:0 (25:22, 25:11)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec3Z1PgeTetmio2q",
            "createdTime": "2022-10-05T06:01:56.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Результат": "2:1 (25:17, 20:25, 15:11)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа G: Лукулл - Заря Крыма 2:1 (25:17, 20:25, 15:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Заря Крыма 2:1 (25:17, 20:25, 15:11)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recJ6qpdfWXmXquGG",
            "createdTime": "2022-10-05T06:01:55.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Команда-проигравший": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Результат": "2:1 (21:25, 25:21, 15:10)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа H: Черноморец-2 - Ралли-поинт 2:1 (21:25, 25:21, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-2 - Ралли-поинт 2:1 (21:25, 25:21, 15:10)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recCTXhk67geQ1jOo",
            "createdTime": "2022-10-05T06:01:53.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Команда-проигравший": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Результат": "2:0 (25:17, 25:20)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа H: Черноморец-2 - Астра 2:0 (25:17, 25:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-2 - Астра 2:0 (25:17, 25:20)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "reclRG0EZxjTBBX8a",
            "createdTime": "2022-10-05T06:01:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Результат": "2:0 (25:17, 25:21)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа H: Астра - Ралли-поинт 2:0 (25:17, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Астра - Ралли-поинт 2:0 (25:17, 25:21)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec10TOVMzZIQdF5N",
            "createdTime": "2022-10-05T06:01:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recmIPtfETs7wIh6N"
                ],
                "Команда-проигравший": [
                    "recVLMP36y7NzwTFk"
                ],
                "Результат": "2:0 (26:24, 25:22)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа I: Дивизион - Таврия 2:0 (26:24, 25:22)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Дивизион - Таврия 2:0 (26:24, 25:22)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recNkFxJDCn7L32w9",
            "createdTime": "2022-10-05T06:01:50.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Команда-проигравший": [
                    "recVLMP36y7NzwTFk"
                ],
                "Результат": "2:0 (25:11, 25:12)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа I: Циркон - Таврия 2:0 (25:11, 25:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Циркон - Таврия 2:0 (25:11, 25:12)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rect21g5LDZcM5hJZ",
            "createdTime": "2022-10-05T06:01:49.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Команда-проигравший": [
                    "recmIPtfETs7wIh6N"
                ],
                "Результат": "2:1 (28:26, 22:25, 15:13)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа I: Циркон - Дивизион 2:1 (28:26, 22:25, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Циркон - Дивизион 2:1 (28:26, 22:25, 15:13)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rech7VqGchznLV7Jx",
            "createdTime": "2022-10-05T06:01:47.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Команда-проигравший": [
                    "recuchsORYh1p8mL5"
                ],
                "Результат": "2:1 (14:25, 25:16, 15:11)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа J: Коралл - Крафт 2:1 (14:25, 25:16, 15:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Коралл - Крафт 2:1 (14:25, 25:16, 15:11)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recTfS1Bd47cGebIn",
            "createdTime": "2022-10-05T06:01:46.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Команда-проигравший": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Результат": "2:1 (25:20, 13:25, 15:11)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа J: Молния - Коралл 2:1 (25:20, 13:25, 15:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Молния - Коралл 2:1 (25:20, 13:25, 15:11)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recwWna9mm0M9NJGk",
            "createdTime": "2022-10-05T06:01:45.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recuchsORYh1p8mL5"
                ],
                "Команда-проигравший": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Результат": "2:0 (25:21, 25:23)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа J: Крафт - Молния 2:0 (25:21, 25:23)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Крафт - Молния 2:0 (25:21, 25:23)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec3zCwr0Q9Q5pnRO",
            "createdTime": "2022-10-05T06:01:44.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа K:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recc19VVVZDHSsDrD",
            "createdTime": "2022-10-05T06:01:43.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа K:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "receigN4H9axCgwwg",
            "createdTime": "2022-10-05T06:01:42.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа K:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recNXvLnJk00b0Akf",
            "createdTime": "2022-10-05T06:01:41.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Команда-проигравший": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Результат": "2:0 (25:19, 25:21)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа L: Омега - Сплин 2:0 (25:19, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Омега - Сплин 2:0 (25:19, 25:21)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec96KBym9IiFGVsM",
            "createdTime": "2022-10-05T06:01:40.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recoWmhWBQWh2jzRL"
                ],
                "Команда-проигравший": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Результат": "2:0 (26:24, 21:17)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа L: ФВМ+1 - Омега 2:0 (26:24, 21:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ФВМ+1 - Омега 2:0 (26:24, 21:17)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rectjwcNrQGQ0cl6B",
            "createdTime": "2022-10-05T06:01:39.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recoWmhWBQWh2jzRL"
                ],
                "Команда-проигравший": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Результат": "2:0 (21:19, 21:16)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа L: ФВМ+1 - Сплин 2:0 (21:19, 21:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ФВМ+1 - Сплин 2:0 (21:19, 21:16)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recQVxjwTAAs8IH89",
            "createdTime": "2022-10-05T06:01:38.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Результат": "2:0 (25:23, 25:12)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа M: Атом - Черноморец-3 2:0 (25:23, 25:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Черноморец-3 2:0 (25:23, 25:12)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec2MU1IRseCMt9BK",
            "createdTime": "2022-10-05T06:01:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Команда-проигравший": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Результат": "2:0 (25:11, 25:16)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа M: Барс - Черноморец-3 2:0 (25:11, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Барс - Черноморец-3 2:0 (25:11, 25:16)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec8KloHqyotnrsFm",
            "createdTime": "2022-10-05T06:01:21.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Результат": "2:0 (25:21, 25:17)",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа M: Атом - Барс 2:0 (25:21, 25:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Барс 2:0 (25:21, 25:17)",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec7YAfGvTsV4p3uw",
            "createdTime": "2022-10-05T06:01:23.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа N:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recbhXdhZrzkPwgFR",
            "createdTime": "2022-10-05T06:01:24.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа N:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recx0HCabF5b2ONlS",
            "createdTime": "2022-10-05T06:01:26.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа N:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec6EQeuSmGUuyfvE",
            "createdTime": "2022-10-05T06:01:29.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа O:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec9Cs5zT4xiptFrO",
            "createdTime": "2022-10-05T06:01:31.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа O:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "recqYXN1U8tNou9du",
            "createdTime": "2022-10-05T06:01:33.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Тур": "2",
                "Матч": "Осень 2022, 2 тур, группа O:  -  ",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": " -  ",
                "ID турнира": [
                    "recTBtRUiBwh3avjf"
                ]
            }
        },
        {
            "id": "rec5SEdrxQ3orMuFR",
            "createdTime": "2022-03-06T18:58:50.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:1 (28:30, 25:21, 15:11)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа C: Легион - Сурож 2:1 (28:30, 25:21, 15:11)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Легион - Сурож 2:1 (28:30, 25:21, 15:11)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recyEMTxBkkl4HytI",
            "createdTime": "2022-03-06T18:59:01.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "rectlFHt9jokhoEon"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:22, 25:19)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа C: Сурож - ЧНГ 2:0 (25:22, 25:19)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Сурож - ЧНГ 2:0 (25:22, 25:19)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recbZfZ21vPxd7uWy",
            "createdTime": "2022-03-06T18:59:09.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:12, 25:20)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа C: Легион - ЧНГ 2:0 (25:12, 25:20)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Легион - ЧНГ 2:0 (25:12, 25:20)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recNS7JkuTbSXcFQ5",
            "createdTime": "2022-03-06T18:59:15.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recQCcUcWqfasbeAr"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "3:0 (25:17, 31:29, 25:19)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа D: Бастион - Ахтиар 3:0 (25:17, 31:29, 25:19)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Бастион - Ахтиар 3:0 (25:17, 31:29, 25:19)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recYdczXEvnm5Hay3",
            "createdTime": "2022-03-06T19:00:23.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recQCcUcWqfasbeAr"
                ],
                "Команда-проигравший": [
                    "recyw2f145WAJGLGx"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа D: Бастион - Медведи  +:- (неявка)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Бастион - Медведи  +:- (неявка)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recA6D84n5LdYA0Gz",
            "createdTime": "2022-03-06T19:00:40.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recyw2f145WAJGLGx"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Весна 2022, 1 тур, группа D: Ахтиар - Медведи  +:- (неявка)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Ахтиар - Медведи  +:- (неявка)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recTrbEXeUVZR8ZkE",
            "createdTime": "2022-04-10T18:23:38.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:0 (25:22, 25:16)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа C: Матчбол - Сурож 2:0 (25:22, 25:16)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Матчбол - Сурож 2:0 (25:22, 25:16)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recrolWhv6f5M67rE",
            "createdTime": "2022-04-10T18:23:37.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:0 (25:19, 25:17)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа C: Матчбол - Бастион 2:0 (25:19, 25:17)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Матчбол - Бастион 2:0 (25:19, 25:17)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recrcLLr7faUQqusC",
            "createdTime": "2022-04-10T18:23:33.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "rectlFHt9jokhoEon"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:1 (25:21, 23:25, 15:13)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа C: Сурож - Бастион 2:1 (25:21, 23:25, 15:13)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Сурож - Бастион 2:1 (25:21, 23:25, 15:13)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recMUw8e3IWDXjAyP",
            "createdTime": "2022-04-03T17:16:37.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recmfw38VhgmGHSxC"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "2:0 (25:18, 25:19)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа D: ЧНГ - Ахтиар 2:0 (25:18, 25:19)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "ЧНГ - Ахтиар 2:0 (25:18, 25:19)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recrQdGZTphJ8KdJy",
            "createdTime": "2022-04-03T17:17:09.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:0 (25:17, 25:18)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа D: Ахтиар - Феникс 2:0 (25:17, 25:18)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Ахтиар - Феникс 2:0 (25:17, 25:18)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "rec2COJm01WPmhyqj",
            "createdTime": "2022-04-03T17:17:16.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recmfw38VhgmGHSxC"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:0 (25:19, 25:20)",
                "Тур": "2",
                "Матч": "Весна 2022, 2 тур, группа D: ЧНГ - Феникс 2:0 (25:19, 25:20)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "ЧНГ - Феникс 2:0 (25:19, 25:20)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recKvagNYDxLHjjgF",
            "createdTime": "2022-06-05T19:50:32.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "полуфинал",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "recV5nUenQAEGrXcU"
                ],
                "Результат": "2:0 (25:18, 25:16)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2022, полуфинал: Легион - Спарта 2:0 (25:18, 25:16)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Легион - Спарта 2:0 (25:18, 25:16)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "rec340WLDUuvAbnwc",
            "createdTime": "2022-06-05T19:50:31.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "полуфинал",
                "Команда-победитель": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Команда-проигравший": [
                    "recf5jCoQc4ebLckG"
                ],
                "Результат": "2:1 (25:22, 24:26, 15:12)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2022, полуфинал: Легион-2 - Мстители 2:1 (25:22, 24:26, 15:12)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Легион-2 - Мстители 2:1 (25:22, 24:26, 15:12)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recqpoJ7oJMYQz6DV",
            "createdTime": "2022-06-05T19:50:30.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "за 3 место",
                "Команда-победитель": [
                    "recf5jCoQc4ebLckG"
                ],
                "Команда-проигравший": [
                    "recV5nUenQAEGrXcU"
                ],
                "Результат": "2:0 (25:16, 28:26)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2022, за 3 место: Мстители - Спарта 2:0 (25:16, 28:26)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Мстители - Спарта 2:0 (25:16, 28:26)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recX6Nle8Tkb04e7s",
            "createdTime": "2022-06-05T19:50:29.000Z",
            "fields": {
                "Турнир link": [
                    "recC6cmCroZm6Rjb6"
                ],
                "Группа": "финал",
                "Команда-победитель": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Команда-проигравший": [
                    "receUzM5hTXJpSw7H"
                ],
                "Результат": "2:0 (25:18, 25:23)",
                "Тур": "Финал четырех",
                "Матч": "Весна 2022, финал: Легион-2 - Легион 2:0 (25:18, 25:23)",
                "Турнир": [
                    "22.1 Весна 2022"
                ],
                "Результат полностью": "Легион-2 - Легион 2:0 (25:18, 25:23)",
                "ID турнира": [
                    "recC6cmCroZm6Rjb6"
                ]
            }
        },
        {
            "id": "recPtxr33Nofv9Svi",
            "createdTime": "2023-01-28T18:39:02.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "receUzM5hTXJpSw7H"
                ],
                "Результат": "2:0 (25:20, 25:14)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа A: Черноморец - Кристалл 2:0 (25:20, 25:14)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Черноморец - Кристалл 2:0 (25:20, 25:14)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recoKl51L0FtGCADa",
            "createdTime": "2023-01-28T18:39:02.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recV5nUenQAEGrXcU"
                ],
                "Результат": "2:0 (25:13, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа A: Черноморец - Спарта 2:0 (25:13, 25:21)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Черноморец - Спарта 2:0 (25:13, 25:21)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recYurLqPViW6oPQr",
            "createdTime": "2023-01-28T18:39:03.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "recnEELXiDFrxIPix"
                ],
                "Команда-проигравший": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Результат": "2:1 (12:25, 25:19, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа B: Алушта - Матчбол 2:1 (12:25, 25:19, 15:13)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Алушта - Матчбол 2:1 (12:25, 25:19, 15:13)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "reczIxZI9i1nUOm5F",
            "createdTime": "2023-01-28T18:39:03.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:0 (25:13, 25:15)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа B: Матчбол - Сурож 2:0 (25:13, 25:15)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Матчбол - Сурож 2:0 (25:13, 25:15)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recFqKBcQ22HpWhRc",
            "createdTime": "2023-01-28T18:39:03.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "receUzM5hTXJpSw7H"
                ],
                "Результат": "2:1 (25:23, 22:25, 15:8)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа A: Спарта - Кристалл 2:1 (25:23, 22:25, 15:8)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Спарта - Кристалл 2:1 (25:23, 22:25, 15:8)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "rec5bbs7isZJAc058",
            "createdTime": "2023-01-28T18:39:04.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "rectlFHt9jokhoEon"
                ],
                "Команда-проигравший": [
                    "recnEELXiDFrxIPix"
                ],
                "Результат": "2:1 (13:25, 25:23, 16:14)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа B: Сурож - Алушта 2:1 (13:25, 25:23, 16:14)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Сурож - Алушта 2:1 (13:25, 25:23, 16:14)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "rec0nExjZJf45pUr9",
            "createdTime": "2023-01-28T18:39:04.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recmfw38VhgmGHSxC"
                ],
                "Команда-проигравший": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Результат": "2:1 (23:25, 25:18, 15:9)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа C: ЧНГ - Лукулл 2:1 (23:25, 25:18, 15:9)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "ЧНГ - Лукулл 2:1 (23:25, 25:18, 15:9)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recwJyvuZYz3pBa88",
            "createdTime": "2023-01-28T18:39:04.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recyw2f145WAJGLGx"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:23, 25:14)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа C: Медведи - ЧНГ 2:0 (25:23, 25:14)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Медведи - ЧНГ 2:0 (25:23, 25:14)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recBmiky7pdEpXjsf",
            "createdTime": "2023-01-28T18:39:04.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "recyw2f145WAJGLGx"
                ],
                "Результат": "2:0 (26:24, 25:22)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа C: Лукулл - Медведи 2:0 (26:24, 25:22)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Лукулл - Медведи 2:0 (26:24, 25:22)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recKZC3AqzSSSQrpa",
            "createdTime": "2023-01-28T18:39:05.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recrMY3m9FkkZRWyv"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа D: Объединение мечты - Строммонтаж +:- (неявка)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Объединение мечты - Строммонтаж +:- (неявка)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "receWyeGLVS2sOYdB",
            "createdTime": "2023-01-28T18:39:05.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа D: Заря Крыма - Строммонтаж +:- (неявка)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Заря Крыма - Строммонтаж +:- (неявка)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "rec2EIujutPwZMIeU",
            "createdTime": "2023-01-28T18:39:05.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recrMY3m9FkkZRWyv"
                ],
                "Команда-проигравший": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Результат": "3:2 (25:23, 25:20, 15:25, 24:26, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа D: Объединение мечты - Заря Крыма 3:2 (25:23, 25:20, 15:25, 24:26, 15:10)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Объединение мечты - Заря Крыма 3:2 (25:23, 25:20, 15:25, 24:26, 15:10)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recn9OEBopMKMCH6b",
            "createdTime": "2023-01-28T18:39:06.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Команда-проигравший": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Результат": "2:0 (25:21, 29:27)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа E: Черноморец-2 - Астра 2:0 (25:21, 29:27)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Черноморец-2 - Астра 2:0 (25:21, 29:27)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recxgWb85jXayOmdt",
            "createdTime": "2023-01-28T18:39:06.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "2:1 (22:25, 25:18, 15:11)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа E: Астра - Ахтиар 2:1 (22:25, 25:18, 15:11)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Астра - Ахтиар 2:1 (22:25, 25:18, 15:11)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recCrYibxV85dE30p",
            "createdTime": "2023-01-28T18:39:06.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "2:0 (25:23, 25:20)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа E: Черноморец-2 - Ахтиар 2:0 (25:23, 25:20)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Черноморец-2 - Ахтиар 2:0 (25:23, 25:20)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recj9DemYkaTlkgq7",
            "createdTime": "2023-01-28T18:39:07.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recuchsORYh1p8mL5"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:0 (25:23, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа F: Крафт - Бастион 2:0 (25:23, 25:19)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Крафт - Бастион 2:0 (25:23, 25:19)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "rec1Gr1caYEssbnkJ",
            "createdTime": "2023-01-28T18:39:07.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:1 (19:25, 25:20, 15:3)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа F: Рейнджерс - Бастион 2:1 (19:25, 25:20, 15:3)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Рейнджерс - Бастион 2:1 (19:25, 25:20, 15:3)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recw2olVS5fs9JmCz",
            "createdTime": "2023-01-28T18:39:07.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recuchsORYh1p8mL5"
                ],
                "Команда-проигравший": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Результат": "2:1 (23:25, 26:24, 15:11)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа F: Крафт - Рейнджерс 2:1 (23:25, 26:24, 15:11)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Крафт - Рейнджерс 2:1 (23:25, 26:24, 15:11)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recn2xfRbAfcluzVb",
            "createdTime": "2023-01-28T18:39:08.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Результат": "3:0 (25:15, 25:21, 25:23)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа H: Карасуно - ЮБК 3:0 (25:15, 25:21, 25:23)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Карасуно - ЮБК 3:0 (25:15, 25:21, 25:23)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recfdYLLF0AZ45RE0",
            "createdTime": "2023-01-28T18:39:08.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Команда-проигравший": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Результат": "2:1 (20:25, 25:13, 16:14)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа G: Оникс - Продвижение 2:1 (20:25, 25:13, 16:14)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Оникс - Продвижение 2:1 (20:25, 25:13, 16:14)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recHppKLGNMUAwdYL",
            "createdTime": "2023-01-28T18:39:08.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "recxt4U4qUW4viRxJ"
                ],
                "Результат": "2:0 (25:20, 25:23)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа G: Продвижение - Нет идей 2:0 (25:20, 25:23)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Продвижение - Нет идей 2:0 (25:20, 25:23)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recaAXsy4iEdFmRCU",
            "createdTime": "2023-01-28T18:39:08.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recxt4U4qUW4viRxJ"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:0 (25:22, 28:26)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа G: Нет идей - Оникс 2:0 (25:22, 28:26)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Нет идей - Оникс 2:0 (25:22, 28:26)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recJaKmtPnFB6J5cq",
            "createdTime": "2023-01-28T18:39:09.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "recDxakzIGaFzydAA"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа H: Карасуно - Импульс +:- (снятие)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Карасуно - Импульс +:- (снятие)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recSgFpd026a0blxl",
            "createdTime": "2023-01-28T18:39:09.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Команда-проигравший": [
                    "recDxakzIGaFzydAA"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа H: ЮБК - Импульс +:- (снятие)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "ЮБК - Импульс +:- (снятие)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recid9PyNBBeuMPjB",
            "createdTime": "2023-01-28T18:39:09.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Результат": "2:1 (25:13, 20:25, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа I: Шторм - Черноморец-3 2:1 (25:13, 20:25, 15:13)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Шторм - Черноморец-3 2:1 (25:13, 20:25, 15:13)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recPgqCOZsAWuZT0m",
            "createdTime": "2023-01-28T18:39:10.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Результат": "2:0 (25:22, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа I: Шторм - Ралли-поинт 2:0 (25:22, 25:19)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Шторм - Ралли-поинт 2:0 (25:22, 25:19)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        },
        {
            "id": "recla2144aeeR45XH",
            "createdTime": "2023-01-28T18:39:10.000Z",
            "fields": {
                "Турнир link": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Команда-проигравший": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Результат": "2:0 (28:26, 25:18)",
                "Тур": "1",
                "Матч": "Осень 2024, 1 тур, группа I: Ралли-поинт - Черноморец-3 2:0 (28:26, 25:18)",
                "Турнир": [
                    "24.2 Осень 2024"
                ],
                "Результат полностью": "Ралли-поинт - Черноморец-3 2:0 (28:26, 25:18)",
                "ID турнира": [
                    "recvaAYU6f4CrFY9T"
                ],
                "Код (from Турнир link)": [
                    "24.2"
                ]
            }
        }
    ];