import {minify} from "../repositories/tournamentsRepository.js"
import {clone} from "../utils.js";

export default class MockTournamentsRepository {
    #data

    constructor() {
        this.reset();
    }

    reset = () => this.#data = this.#initialData();

    #initialData = () => clone(tournaments).map(p => minify(p));

    getAllRecords = () => this.#data;

    getById = id => Promise.resolve(this.#data.find(t => t.id === id));

    getPrevious = tournament => Promise
        .resolve([...this.#data]
            .sort((a, b) => b.code - a.code)
            .find(t => t.type === tournament.type && t.format === tournament.format && t.code < tournament.code));
}

const tournaments = [
    {
        "id": "recTBtRUiBwh3avjf",
        "createdTime": "2022-08-22T09:12:40.000Z",
        "fields": {
            "Название": "Осень 2022",
            "Статус": "В процессе",
            "Код": "22.4",
            "Формат": "mix",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recS1F79Hww82HvFP",
        "createdTime": "2022-07-21T13:47:11.000Z",
        "fields": {
            "Название": "Летний кубок 2022 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "22.3",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recAZv73zCdZ3e5Ty",
        "createdTime": "2022-07-01T13:13:52.000Z",
        "fields": {
            "Название": "Летний кубок 2022 женщины",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "22.2",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recC6cmCroZm6Rjb6",
        "createdTime": "2022-03-05T10:01:48.000Z",
        "fields": {
            "Название": "Весна 2022",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "22.1",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "receG3kCec3AbPH2F",
        "createdTime": "2022-03-05T10:01:48.000Z",
        "fields": {
            "Название": "Осень 2021",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "21.5",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recq1Z4z3d5SurKAl",
        "createdTime": "2022-03-05T10:01:48.000Z",
        "fields": {
            "Название": "Летний кубок 2021 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "21.4",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "rec8j6WV324CLH3ce",
        "createdTime": "2022-03-09T12:09:32.000Z",
        "fields": {
            "Название": "Летний кубок 2021 женщины",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "21.3",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recyfsgmSypnLt26c",
        "createdTime": "2022-03-09T13:02:53.000Z",
        "fields": {
            "Название": "Весна 2021",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "21.2",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recj7n9i7WePwqKp0",
        "createdTime": "2022-03-09T18:35:08.000Z",
        "fields": {
            "Название": "Зимний кубок 2021",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "21.1",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recGxKeftchIR5YPw",
        "createdTime": "2022-03-09T18:48:44.000Z",
        "fields": {
            "Название": "Зимний кубок 2020 женщины",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "20.4",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recJFM2U2MOStHHxy",
        "createdTime": "2022-03-09T20:33:41.000Z",
        "fields": {
            "Название": "Сезон 2020",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "20.3",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "rec8UvjJpVVFPgYeM",
        "createdTime": "2022-03-10T14:49:48.000Z",
        "fields": {
            "Название": "Зимний кубок 2020 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "20.2",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recggtShPilZaWwxP",
        "createdTime": "2022-03-10T18:16:01.000Z",
        "fields": {
            "Название": "Зимний кубок 2020",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "20.1",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recGqPiSEckXxZr4k",
        "createdTime": "2022-03-10T18:30:17.000Z",
        "fields": {
            "Название": "Зимний кубок 2019 женщины",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "19.5",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recDbQAPsEKo79xgQ",
        "createdTime": "2022-03-10T18:37:18.000Z",
        "fields": {
            "Название": "Осень 2019",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "19.4",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recd1VLd4lL5Q8QGI",
        "createdTime": "2022-03-10T18:51:18.000Z",
        "fields": {
            "Название": "Летний кубок 2019 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "19.3",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "reciccPFPLmrPMiMP",
        "createdTime": "2022-03-10T18:59:16.000Z",
        "fields": {
            "Название": "Летний кубок 2019",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "19.2",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recTtRB65eazRYHOI",
        "createdTime": "2022-03-10T19:17:56.000Z",
        "fields": {
            "Название": "Весна 2019",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "19.1",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "rec8VJvzuBBoq2grl",
        "createdTime": "2022-03-11T18:48:35.000Z",
        "fields": {
            "Название": "Осень 2018",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "18.7",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recCCtHJcBHOqCFzj",
        "createdTime": "2022-03-12T17:37:23.000Z",
        "fields": {
            "Название": "Летний кубок 2018 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "18.6",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "rec3uhqkWhZb1gPSV",
        "createdTime": "2022-03-13T17:59:55.000Z",
        "fields": {
            "Название": "Летний кубок 2018",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "18.5",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recBreIDBjhRi9vmO",
        "createdTime": "2022-03-13T18:14:32.000Z",
        "fields": {
            "Название": "Весна 2018",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "18.4",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recVLif0P9vFCvafJ",
        "createdTime": "2022-03-13T18:46:29.000Z",
        "fields": {
            "Название": "Кубок вызова 2018",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "18.3",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recf24GRxes2I2NTY",
        "createdTime": "2022-03-13T18:58:27.000Z",
        "fields": {
            "Название": "Зимний кубок 2018 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "18.2",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recIsrq3xNn1VT3fw",
        "createdTime": "2022-03-13T18:58:37.000Z",
        "fields": {
            "Название": "Зимний кубок 2018",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "18.1",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recZMOLn7jRSmL3o7",
        "createdTime": "2022-03-13T19:19:57.000Z",
        "fields": {
            "Название": "Осень 2017",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "17.7",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recKxeHZpTn2YfsfN",
        "createdTime": "2022-03-13T19:21:19.000Z",
        "fields": {
            "Название": "Летний кубок 2017 женщины",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "17.6",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recjwad7XuIjiHt4B",
        "createdTime": "2022-03-13T19:21:38.000Z",
        "fields": {
            "Название": "Летний кубок 2017 мужчины",
            "Статус": "Завершен",
            "Формат": "мужской",
            "Код": "17.5",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recNr1DqZjHMBQy3l",
        "createdTime": "2022-03-13T19:21:47.000Z",
        "fields": {
            "Название": "Летний кубок 2017",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "17.4",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recgVaZ4FkZcJ1OzO",
        "createdTime": "2022-03-13T19:21:48.000Z",
        "fields": {
            "Название": "Весна 2017",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "17.3",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "reccAnG9CnDoKQk8a",
        "createdTime": "2022-03-13T19:21:56.000Z",
        "fields": {
            "Название": "Зима 2017",
            "Статус": "Завершен",
            "Формат": "женский",
            "Код": "17.2",
            "Тип турнира": "Сезон"
        }
    },
    {
        "id": "recrhVavSJ7oiV60t",
        "createdTime": "2022-03-13T19:22:06.000Z",
        "fields": {
            "Название": "Зимний кубок 2017",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "17.1",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recoGoQOTtTqdSrZx",
        "createdTime": "2022-03-13T19:22:18.000Z",
        "fields": {
            "Название": "Осень 2016",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "16.2",
            "Тип турнира": "Кубковый"
        }
    },
    {
        "id": "recgSKP6arR9wmy4a",
        "createdTime": "2022-03-13T19:22:26.000Z",
        "fields": {
            "Название": "Весна 2016",
            "Статус": "Завершен",
            "Формат": "mix",
            "Код": "16.1",
            "Тип турнира": "Кубковый"
        }
    }
];