import {minify} from "../repositories/resultsRepository.js";
import {clone} from "../utils.js";

export default class MockResultsRepository {
    #data

    constructor() {
        this.reset();
    }

    reset = () => this.#data = this.#initialData();

    #initialData = () => clone(mockResults).map(p => minify(p));

    getAllRecordsPromise = params => Promise.resolve(this.getAllRecords(params));

    getByTournamentAndTour = (tournament, tour) => Promise
        .resolve(this.#data.filter(r => r.tournament === tournament && r.tour === tour))

    getAllRecords = params => params && params.maxRecords ? this.#data.slice(0, params.maxRecords) : this.#data;

    getGroup = group => this.#data.filter(r => r.group === group).map(r => clone(r))

    getGroups = groups => this.#data.filter(r => groups.includes(r.group)).map(r => clone(r))
}

const mockResults =
    [
        {
            "id": "reccO2eTQ9F2q2QMe",
            "createdTime": "2022-09-05T08:02:21.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "2:0 (25:21, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Спарта - Легион-2 2:0 (25:21, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Спарта - Легион-2 2:0 (25:21, 25:21)"
            }
        },
        {
            "id": "recm91ImMEe490Hem",
            "createdTime": "2022-09-05T08:02:22.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recf5jCoQc4ebLckG"
                ],
                "Команда-проигравший": [
                    "recwdXiTwfieWJ2zl"
                ],
                "Результат": "2:1 (25:18, 20:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Мстители - Легион-2 2:1 (25:18, 20:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Мстители - Легион-2 2:1 (25:18, 20:25, 15:12)"
            }
        },
        {
            "id": "recJWTWWABYKglu1l",
            "createdTime": "2022-09-05T08:02:23.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "A",
                "Команда-победитель": [
                    "recV5nUenQAEGrXcU"
                ],
                "Команда-проигравший": [
                    "recf5jCoQc4ebLckG"
                ],
                "Результат": "2:1 (25:19, 23:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа A: Спарта - Мстители 2:1 (25:19, 23:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Спарта - Мстители 2:1 (25:19, 23:25, 15:10)"
            }
        },
        {
            "id": "recgigCvlhm4ex65d",
            "createdTime": "2022-09-05T08:02:19.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Результат": "2:1 (25:15, 25:27, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Легион - Матчбол 2:1 (25:15, 25:27, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Легион - Матчбол 2:1 (25:15, 25:27, 15:12)"
            }
        },
        {
            "id": "reci4Qhl8CZwLsvZV",
            "createdTime": "2022-09-05T08:02:20.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "receUzM5hTXJpSw7H"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:0 (25:11, 25:17)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Легион - Сурож 2:0 (25:11, 25:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Легион - Сурож 2:0 (25:11, 25:17)"
            }
        },
        {
            "id": "rechWVrekFl3VX9zt",
            "createdTime": "2022-09-05T08:02:21.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "B",
                "Команда-победитель": [
                    "reca5NQVSKm3gmn8C"
                ],
                "Команда-проигравший": [
                    "rectlFHt9jokhoEon"
                ],
                "Результат": "2:1 (22:25, 25:19, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа B: Матчбол - Сурож 2:1 (22:25, 25:19, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Матчбол - Сурож 2:1 (22:25, 25:19, 15:10)"
            }
        },
        {
            "id": "rec16LiUR8p2LTJN7",
            "createdTime": "2022-09-04T19:06:35.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recQCcUcWqfasbeAr"
                ],
                "Результат": "2:1 (25:18, 23:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Черноморец - Бастион 2:1 (25:18, 23:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец - Бастион 2:1 (25:18, 23:25, 15:10)"
            }
        },
        {
            "id": "recLmyvXm8OqY2OAG",
            "createdTime": "2022-09-04T19:06:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recBpK5dYCD9rugER"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:20, 26:24)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Черноморец - ЧНГ 2:0 (25:20, 26:24)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец - ЧНГ 2:0 (25:20, 26:24)"
            }
        },
        {
            "id": "recgZYGgMvDc13jRr",
            "createdTime": "2022-09-04T19:06:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "C",
                "Команда-победитель": [
                    "recQCcUcWqfasbeAr"
                ],
                "Команда-проигравший": [
                    "recmfw38VhgmGHSxC"
                ],
                "Результат": "2:0 (25:20, 25:15)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа C: Бастион - ЧНГ 2:0 (25:20, 25:15)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Бастион - ЧНГ 2:0 (25:20, 25:15)"
            }
        },
        {
            "id": "recyU2CI3Z2xqUSvz",
            "createdTime": "2022-09-05T08:02:40.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recnEELXiDFrxIPix"
                ],
                "Команда-проигравший": [
                    "recst39AJwl7Edi0c"
                ],
                "Результат": "2:0 (27:25, 25:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Алушта - Комус 2:0 (27:25, 25:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Алушта - Комус 2:0 (27:25, 25:20)"
            }
        },
        {
            "id": "recHNJU5R45MUcaAm",
            "createdTime": "2022-09-05T08:02:41.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recst39AJwl7Edi0c"
                ],
                "Команда-проигравший": [
                    "recDxakzIGaFzydAA"
                ],
                "Результат": "2:1 (14:25, 25:21, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Комус - Импульс 2:1 (14:25, 25:21, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Комус - Импульс 2:1 (14:25, 25:21, 15:13)"
            }
        },
        {
            "id": "recA53vyql8U3ykTk",
            "createdTime": "2022-09-05T08:02:41.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "D",
                "Команда-победитель": [
                    "recDxakzIGaFzydAA"
                ],
                "Команда-проигравший": [
                    "recnEELXiDFrxIPix"
                ],
                "Результат": "2:1 (19:25, 27:25, 17:15)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа D: Импульс - Алушта 2:1 (19:25, 27:25, 17:15)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Импульс - Алушта 2:1 (19:25, 27:25, 17:15)"
            }
        },
        {
            "id": "rec6t1t7DDPNehWgw",
            "createdTime": "2022-09-05T08:02:37.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Команда-проигравший": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Результат": "2:1 (25:18, 21:25, 18:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Феникс - Ахтиар 2:1 (25:18, 21:25, 18:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Феникс - Ахтиар 2:1 (25:18, 21:25, 18:16)"
            }
        },
        {
            "id": "recyx0nEOoyQKNibm",
            "createdTime": "2022-09-05T08:02:38.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "recyw2f145WAJGLGx"
                ],
                "Команда-проигравший": [
                    "recq7xUDdmjx5Ngal"
                ],
                "Результат": "2:0 (25:19, 25:22)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Медведи - Феникс 2:0 (25:19, 25:22)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Медведи - Феникс 2:0 (25:19, 25:22)"
            }
        },
        {
            "id": "recgoBwtqudHz4X1E",
            "createdTime": "2022-09-05T08:02:39.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "E",
                "Команда-победитель": [
                    "rec3S7eXfpZv3l7q0"
                ],
                "Команда-проигравший": [
                    "recyw2f145WAJGLGx"
                ],
                "Результат": "2:0 (27:25, 25:18)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа E: Ахтиар - Медведи 2:0 (27:25, 25:18)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ахтиар - Медведи 2:0 (27:25, 25:18)"
            }
        },
        {
            "id": "recennXF3kBU53a9j",
            "createdTime": "2022-09-05T08:02:34.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:1 (24:26, 25:16, 15:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: Рейнджерс - Оникс 2:1 (24:26, 25:16, 15:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Рейнджерс - Оникс 2:1 (24:26, 25:16, 15:13)"
            }
        },
        {
            "id": "rec6sTDWV7d5VWx4D",
            "createdTime": "2022-09-05T08:02:35.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "recxx0ELRBmt2lYoH"
                ],
                "Команда-проигравший": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Результат": "2:1 (25:19, 22:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: Рейнджерс - ЮБК 2:1 (25:19, 22:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Рейнджерс - ЮБК 2:1 (25:19, 22:25, 15:10)"
            }
        },
        {
            "id": "recOwB9qn8DBSnpKH",
            "createdTime": "2022-09-05T08:02:36.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "F",
                "Команда-победитель": [
                    "rec2hQpJTPt5WSRZf"
                ],
                "Команда-проигравший": [
                    "rec4KbD8N7XB3hmEA"
                ],
                "Результат": "2:1 (25:22, 21:25, 15:9)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа F: ЮБК - Оникс 2:1 (25:22, 21:25, 15:9)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ЮБК - Оникс 2:1 (25:22, 21:25, 15:9)"
            }
        },
        {
            "id": "recSZRCdzXxxda5Pp",
            "createdTime": "2022-09-05T08:02:31.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Результат": "2:0 (25:21, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Продвижение - Черноморец-2 2:0 (25:21, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - Черноморец-2 2:0 (25:21, 25:19)"
            }
        },
        {
            "id": "recLwnDmjxZcFyM34",
            "createdTime": "2022-09-05T08:02:32.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Команда-проигравший": [
                    "recnTZ9QZUryBmf7E"
                ],
                "Результат": "2:0 (25:23, 25:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Заря Крыма - Черноморец-2 2:0 (25:23, 25:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Заря Крыма - Черноморец-2 2:0 (25:23, 25:20)"
            }
        },
        {
            "id": "recqBc8IcLjBL4PHe",
            "createdTime": "2022-09-05T08:02:33.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "G",
                "Команда-победитель": [
                    "recUdDhsqd0WU5Hgo"
                ],
                "Команда-проигравший": [
                    "rec9nD4ARhpsgcvUU"
                ],
                "Результат": "2:1 (21:25, 25:17, 15:11)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа G: Продвижение - Заря Крыма 2:1 (21:25, 25:17, 15:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Продвижение - Заря Крыма 2:1 (21:25, 25:17, 15:11)"
            }
        },
        {
            "id": "recyIE1hjHJt9fnU4",
            "createdTime": "2022-09-04T19:06:32.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Команда-проигравший": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Результат": "2:0 (25:17, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Ралли-поинт - Циркон 2:0 (25:17, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Ралли-поинт - Циркон 2:0 (25:17, 25:19)"
            }
        },
        {
            "id": "recQgoNjPa2oBZFKY",
            "createdTime": "2022-09-04T19:06:33.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "recmS8BgTWn8QIpqc"
                ],
                "Результат": "2:0 (25:20, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Лукулл - Циркон 2:0 (25:20, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Циркон 2:0 (25:20, 25:16)"
            }
        },
        {
            "id": "reczXMPXXcA7Itycp",
            "createdTime": "2022-09-04T19:06:34.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "H",
                "Команда-победитель": [
                    "rec0yMKHYH64GWmVb"
                ],
                "Команда-проигравший": [
                    "recMPmbwQFBKGVSoM"
                ],
                "Результат": "2:0 (25:19, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа H: Лукулл - Ралли-поинт 2:0 (25:19, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Лукулл - Ралли-поинт 2:0 (25:19, 25:19)"
            }
        },
        {
            "id": "recBrXOPNEFlaEgMS",
            "createdTime": "2022-09-05T08:02:58.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "recuchsORYh1p8mL5"
                ],
                "Результат": "2:0 (25:21, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Астра - Крафт 2:0 (25:21, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Астра - Крафт 2:0 (25:21, 25:16)"
            }
        },
        {
            "id": "rechP6ldKv2tQFY3F",
            "createdTime": "2022-09-05T08:02:59.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "recVLMP36y7NzwTFk"
                ],
                "Команда-проигравший": [
                    "recuchsORYh1p8mL5"
                ],
                "Результат": "2:0 (25:22, 26:24)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Таврия - Крафт 2:0 (25:22, 26:24)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Таврия - Крафт 2:0 (25:22, 26:24)"
            }
        },
        {
            "id": "recnDuXCXopiG83ao",
            "createdTime": "2022-09-05T08:03:00.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "I",
                "Команда-победитель": [
                    "rec7V4fSrk0kxRBcR"
                ],
                "Команда-проигравший": [
                    "recVLMP36y7NzwTFk"
                ],
                "Результат": "2:0 (25:16, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа I: Астра - Таврия 2:0 (25:16, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Астра - Таврия 2:0 (25:16, 25:19)"
            }
        },
        {
            "id": "recClm0hl6L2wI4E4",
            "createdTime": "2022-09-05T08:02:56.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recmIPtfETs7wIh6N"
                ],
                "Команда-проигравший": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Результат": "2:0 (25:14, 25:17)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Дивизион - Молния 2:0 (25:14, 25:17)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Дивизион - Молния 2:0 (25:14, 25:17)"
            }
        },
        {
            "id": "recDAMjiQELaWttDj",
            "createdTime": "2022-09-05T08:02:56.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "rec8BwgNp8nnHt1kw"
                ],
                "Команда-проигравший": [
                    "recWxZUi2wubRzEsb"
                ],
                "Результат": "2:1 (25:10, 17:25, 15:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Молния - Динамит 2:1 (25:10, 17:25, 15:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Молния - Динамит 2:1 (25:10, 17:25, 15:10)"
            }
        },
        {
            "id": "recEyXi0HXCj0nqJB",
            "createdTime": "2022-09-05T08:02:57.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "J",
                "Команда-победитель": [
                    "recmIPtfETs7wIh6N"
                ],
                "Команда-проигравший": [
                    "recWxZUi2wubRzEsb"
                ],
                "Результат": "2:1 (26:24, 20:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа J: Дивизион - Динамит 2:1 (26:24, 20:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Дивизион - Динамит 2:1 (26:24, 20:25, 15:12)"
            }
        },
        {
            "id": "recvCwyemBB4Z8iSP",
            "createdTime": "2022-09-05T08:02:54.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Команда-победитель": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Команда-проигравший": [
                    "recoWmhWBQWh2jzRL"
                ],
                "Результат": "+:- (неявка)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа K: Коралл - ФВМ+1 +:- (неявка)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Коралл - ФВМ+1 +:- (неявка)"
            }
        },
        {
            "id": "rec2bk4kHqBT7JOxH",
            "createdTime": "2022-09-05T08:02:55.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "K",
                "Команда-победитель": [
                    "recUZ9IN2r9brYDa6"
                ],
                "Команда-проигравший": [
                    "rec9HmVM1YlrsaUR6"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа K: Коралл - Хром +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Коралл - Хром +:- (снятие)"
            }
        },
        {
            "id": "recDYnTKWiiRCikzv",
            "createdTime": "2022-09-05T08:02:50.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recMYX0UQ505TwwQL"
                ],
                "Команда-проигравший": [
                    "reccEe7SloEGYhD9e"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Стрела - Штурм +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Стрела - Штурм +:- (снятие)"
            }
        },
        {
            "id": "reczwoax8xxGAMvOI",
            "createdTime": "2022-09-05T08:02:51.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "reccEe7SloEGYhD9e"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Карасуно - Штурм +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Карасуно - Штурм +:- (снятие)"
            }
        },
        {
            "id": "reckL9GpAvJyJKBqw",
            "createdTime": "2022-09-05T08:02:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "L",
                "Команда-победитель": [
                    "recsucLBwtB8WNkC6"
                ],
                "Команда-проигравший": [
                    "recMYX0UQ505TwwQL"
                ],
                "Результат": "3:1 (25:20, 20:25, 25:18, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа L: Карасуно - Стрела 3:1 (25:20, 20:25, 25:18, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Карасуно - Стрела 3:1 (25:20, 20:25, 25:18, 25:21)"
            }
        },
        {
            "id": "rec1E0nhgy1oUduJ0",
            "createdTime": "2022-08-27T20:35:51.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Команда-проигравший": [
                    "reche4L2VLav89gU5"
                ],
                "Результат": "2:0 (25:17, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Сплин - Некома 2:0 (25:17, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Сплин - Некома 2:0 (25:17, 25:21)"
            }
        },
        {
            "id": "recbKnIxiqukTdQtk",
            "createdTime": "2022-08-27T20:35:52.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Команда-проигравший": [
                    "rec8ZHRbPI4NNyGfL"
                ],
                "Результат": "2:0 (25:17, 25:21)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Омега - Сплин 2:0 (25:17, 25:21)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Омега - Сплин 2:0 (25:17, 25:21)"
            }
        },
        {
            "id": "recGGMXyg7sOZhYIL",
            "createdTime": "2022-08-27T20:35:53.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "M",
                "Команда-победитель": [
                    "recoXc9lMlrWdFoOg"
                ],
                "Команда-проигравший": [
                    "reche4L2VLav89gU5"
                ],
                "Результат": "2:0 (25:12, 25:19)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа M: Омега - Некома 2:0 (25:12, 25:19)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Омега - Некома 2:0 (25:12, 25:19)"
            }
        },
        {
            "id": "rec3ObcECKAeyDVjE",
            "createdTime": "2022-09-05T08:03:09.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Команда-проигравший": [
                    "recwRIDRji0gaA92X"
                ],
                "Результат": "3:1 (25:14, 25:16, 20:25, 25:16)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Барс - Домино 3:1 (25:14, 25:16, 20:25, 25:16)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Барс - Домино 3:1 (25:14, 25:16, 20:25, 25:16)"
            }
        },
        {
            "id": "rec9QmNCp9ByVl636",
            "createdTime": "2022-09-05T08:03:10.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recoeMMLqnbFNAvIJ"
                ],
                "Результат": "2:0 (25:23, 25:11)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Атом - Барс 2:0 (25:23, 25:11)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Барс 2:0 (25:23, 25:11)"
            }
        },
        {
            "id": "recKpX0XiZxvV3FBd",
            "createdTime": "2022-09-05T08:03:11.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "N",
                "Команда-победитель": [
                    "recbn6QHSm4wAfzbq"
                ],
                "Команда-проигравший": [
                    "recwRIDRji0gaA92X"
                ],
                "Результат": "2:0 (25:7, 25:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа N: Атом - Домино 2:0 (25:7, 25:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Атом - Домино 2:0 (25:7, 25:12)"
            }
        },
        {
            "id": "recZux0gk1o9p7mcy",
            "createdTime": "2022-09-05T08:03:06.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "rec9GbvD9xEOe7ksG"
                ],
                "Команда-проигравший": [
                    "rec7IAXxfzLtdhMsg"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Энель - Карма +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Энель - Карма +:- (снятие)"
            }
        },
        {
            "id": "recZsFRLDko9j8U23",
            "createdTime": "2022-09-05T08:03:07.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Команда-проигравший": [
                    "rec7IAXxfzLtdhMsg"
                ],
                "Результат": "+:- (снятие)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Черноморец-3 - Карма +:- (снятие)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-3 - Карма +:- (снятие)"
            }
        },
        {
            "id": "recBWVGqJpveh0QO4",
            "createdTime": "2022-09-05T08:03:08.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "O",
                "Команда-победитель": [
                    "recXu7MPHQpXpp5s1"
                ],
                "Команда-проигравший": [
                    "rec9GbvD9xEOe7ksG"
                ],
                "Результат": "3:2 (25:20, 25:14, 18:25, 22:25, 22:20)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа O: Черноморец-3 - Энель 3:2 (25:20, 25:14, 18:25, 22:25, 22:20)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Черноморец-3 - Энель 3:2 (25:20, 25:14, 18:25, 22:25, 22:20)"
            }
        },
        {
            "id": "recLqvctrsE47Mcek",
            "createdTime": "2022-09-04T19:06:29.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recrlWD64QAqzpZ9O"
                ],
                "Результат": "2:1 (25:15, 23:25, 15:12)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: Шторм - ЭкоПик 2:1 (25:15, 23:25, 15:12)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Шторм - ЭкоПик 2:1 (25:15, 23:25, 15:12)"
            }
        },
        {
            "id": "recqh4YVzzVJGzlnp",
            "createdTime": "2022-09-04T19:06:30.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "recrlWD64QAqzpZ9O"
                ],
                "Команда-проигравший": [
                    "recc8PkfQSTRuAKZg"
                ],
                "Результат": "2:0 (25:20, 25:13)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: ЭкоПик - Ортус 2:0 (25:20, 25:13)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "ЭкоПик - Ортус 2:0 (25:20, 25:13)"
            }
        },
        {
            "id": "recMgwoW8c5vZh5cB",
            "createdTime": "2022-09-04T19:06:31.000Z",
            "fields": {
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Группа": "P",
                "Команда-победитель": [
                    "rec5bpX1gX6m9koGz"
                ],
                "Команда-проигравший": [
                    "recc8PkfQSTRuAKZg"
                ],
                "Результат": "2:0 (25:11, 25:10)",
                "Тур": "1",
                "Матч": "Осень 2022, 1 тур, группа P: Шторм - Ортус 2:0 (25:11, 25:10)",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Результат полностью": "Шторм - Ортус 2:0 (25:11, 25:10)"
            }
        },
        {
            "id": "recNXkKxfsDoPLCSQ",
            "createdTime": "2022-10-14T21:21:18.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - Аленка и компания -:- (неявка)",
                "Результат полностью": " - Аленка и компания -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "recrnpNtzebiv8cC7"
                ],
                "Результат": "-:- (неявка)"
            }
        },
        {
            "id": "recr0ePfvCOOdqxEo",
            "createdTime": "2022-10-14T21:21:20.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - Акулки -:- (неявка)",
                "Результат полностью": " - Акулки -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "recOD3widNtopWjf7"
                ],
                "Результат": "-:- (неявка)"
            }
        },
        {
            "id": "reczo7IrTvGW5dFPd",
            "createdTime": "2022-10-14T21:21:21.000Z",
            "fields": {
                "Матч": "Осень 2022, 1 тур, группа P:  - 17м/с -:- (неявка)",
                "Результат полностью": " - 17м/с -:- (неявка)",
                "Турнир link": [
                    "recTBtRUiBwh3avjf"
                ],
                "Тур": "1",
                "Турнир": [
                    "22.4 Осень 2022"
                ],
                "Группа": "Q",
                "Команда-проигравший": [
                    "reczIrCoCxiUr3LnJ"
                ],
                "Результат": "-:- (неявка)"
            }
        }
    ];