import {minify} from "../repositories/teamsRepository.js";
import {clone} from "../utils.js";

export default class MockTeamsRepository {
    #data

    constructor() {
        this.reset();
    }

    reset = () => this.#data = this.#initialData();

    #initialData = () => clone(teams).map(p => minify(p));

    getAllRecords = () => this.#data;

    getById = id => Promise.resolve(this.#data.find(t => id === t.id));
}

const teams = [
    {
        "id": "recG8VvrEOgzMe8yD",
        "createdTime": "2022-03-09T12:21:02.000Z",
        "fields": {
            "Название": "АТА",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-01-30"
        }
    },
    {
        "id": "reczIrCoCxiUr3LnJ",
        "createdTime": "2022-03-14T20:36:33.000Z",
        "fields": {
            "Название": "17м/с",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-12-20"
        }
    },
    {
        "id": "recOD3widNtopWjf7",
        "createdTime": "2022-03-16T18:33:58.000Z",
        "fields": {
            "Название": "Акулки",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-12-27"
        }
    },
    {
        "id": "recrnpNtzebiv8cC7",
        "createdTime": "2022-03-17T07:13:37.000Z",
        "fields": {
            "Название": "Аленка и компания",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-04-19"
        }
    },
    {
        "id": "recwl3YCwW6U37hV4",
        "createdTime": "2022-03-09T12:43:20.000Z",
        "fields": {
            "Название": "Алустон",
            "Город": "Алушта",
            "Регистрация в Лиге": "2019-11-22"
        }
    },
    {
        "id": "recnEELXiDFrxIPix",
        "createdTime": "2022-03-05T18:54:34.000Z",
        "fields": {
            "Название": "Алушта",
            "Город": "Алушта",
            "Регистрация в Лиге": "2017-08-27"
        }
    },
    {
        "id": "recZ3Qa4pj8JKOzM4",
        "createdTime": "2022-03-09T20:37:26.000Z",
        "fields": {
            "Название": "Альма",
            "Город": "Бахчисарайский район",
            "Регистрация в Лиге": "2019-05-07"
        }
    },
    {
        "id": "recynyqEDVHyVyk27",
        "createdTime": "2022-03-10T14:55:11.000Z",
        "fields": {
            "Название": "Альма-Крым",
            "Город": "Андреевка",
            "Регистрация в Лиге": "2018-02-23"
        }
    },
    {
        "id": "recRVFZaAl1tOPBOW",
        "createdTime": "2022-07-27T09:23:05.000Z",
        "fields": {
            "Название": "Альянс",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-07-25"
        }
    },
    {
        "id": "recnx5HvhD4FcCCbL",
        "createdTime": "2022-03-09T13:11:07.000Z",
        "fields": {
            "Название": "Апгрейд",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-03-31"
        }
    },
    {
        "id": "recTgqW2fL8vX9vOP",
        "createdTime": "2022-03-14T18:10:11.000Z",
        "fields": {
            "Название": "Артек",
            "Город": "Гурзуф",
            "Регистрация в Лиге": "2017-09-29"
        }
    },
    {
        "id": "rec7V4fSrk0kxRBcR",
        "createdTime": "2022-03-05T19:04:46.000Z",
        "fields": {
            "Название": "Астра",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "recbmEGNRfOhuB2ga",
        "createdTime": "2022-03-16T18:00:02.000Z",
        "fields": {
            "Название": "Атлант",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-03-11"
        }
    },
    {
        "id": "recbn6QHSm4wAfzbq",
        "createdTime": "2022-08-22T09:03:36.000Z",
        "fields": {
            "Название": "Атом",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "rec3S7eXfpZv3l7q0",
        "createdTime": "2022-03-05T19:02:38.000Z",
        "fields": {
            "Название": "Ахтиар",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-04-08"
        }
    },
    {
        "id": "recDaZodsJJLAkYDs",
        "createdTime": "2022-03-10T14:54:57.000Z",
        "fields": {
            "Название": "Балаклава",
            "Город": "Балаклава",
            "Регистрация в Лиге": "2016-03-14"
        }
    },
    {
        "id": "recoeMMLqnbFNAvIJ",
        "createdTime": "2022-08-22T09:03:16.000Z",
        "fields": {
            "Название": "Барс",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "recQCcUcWqfasbeAr",
        "createdTime": "2022-03-05T19:02:46.000Z",
        "fields": {
            "Название": "Бастион",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-02-23"
        }
    },
    {
        "id": "recs81bRJGIJymEIe",
        "createdTime": "2022-03-09T12:21:51.000Z",
        "fields": {
            "Название": "Василек",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-07-23"
        }
    },
    {
        "id": "recPGlUlbk7S1Ga99",
        "createdTime": "2022-03-11T18:51:49.000Z",
        "fields": {
            "Название": "Вендетта",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-09-26"
        }
    },
    {
        "id": "recUhTo8BiYGNpk77",
        "createdTime": "2022-03-14T20:46:10.000Z",
        "fields": {
            "Название": "Вымпел",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-02-24"
        }
    },
    {
        "id": "recENvnVdJldwMNTt",
        "createdTime": "2022-03-10T14:56:50.000Z",
        "fields": {
            "Название": "Д-Спорт",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2020-01-24"
        }
    },
    {
        "id": "recmIPtfETs7wIh6N",
        "createdTime": "2022-08-22T09:06:15.000Z",
        "fields": {
            "Название": "Дивизион",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "recWxZUi2wubRzEsb",
        "createdTime": "2022-03-05T19:04:49.000Z",
        "fields": {
            "Название": "Динамит",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "rec9nD4ARhpsgcvUU",
        "createdTime": "2022-03-05T19:02:53.000Z",
        "fields": {
            "Название": "Заря Крыма",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-02-11"
        }
    },
    {
        "id": "recktTlnzVNm4jy1J",
        "createdTime": "2022-03-10T19:12:01.000Z",
        "fields": {
            "Название": "Звезда",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2019-03-16"
        }
    },
    {
        "id": "recyfiUTizkoNA51P",
        "createdTime": "2022-03-11T18:51:07.000Z",
        "fields": {
            "Название": "Зенит",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-10-26"
        }
    },
    {
        "id": "reckBYjVv4ndvEb0q",
        "createdTime": "2022-03-14T17:58:47.000Z",
        "fields": {
            "Название": "Зенит СГУ",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-08-02"
        }
    },
    {
        "id": "rec0ptaaUl7Z98NYY",
        "createdTime": "2022-03-14T17:52:34.000Z",
        "fields": {
            "Название": "Империал",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-09-26"
        }
    },
    {
        "id": "recDxakzIGaFzydAA",
        "createdTime": "2022-03-05T19:02:54.000Z",
        "fields": {
            "Название": "Импульс",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2021-08-12"
        }
    },
    {
        "id": "recZLHtZB8Vw9rAF3",
        "createdTime": "2022-03-14T18:05:17.000Z",
        "fields": {
            "Название": "Инваспорт",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-02-02"
        }
    },
    {
        "id": "rechBRmRYHuOkZCtg",
        "createdTime": "2022-03-05T20:01:03.000Z",
        "fields": {
            "Название": "Искра",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-03-21"
        }
    },
    {
        "id": "recwKWkSP0YbPTEOH",
        "createdTime": "2022-03-10T18:23:36.000Z",
        "fields": {
            "Название": "Искра (женская)",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2019-11-22"
        }
    },
    {
        "id": "recsucLBwtB8WNkC6",
        "createdTime": "2022-03-05T19:04:58.000Z",
        "fields": {
            "Название": "Карасуно",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "rec7IAXxfzLtdhMsg",
        "createdTime": "2022-07-01T13:28:21.000Z",
        "fields": {
            "Название": "Карма",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-07-01"
        }
    },
    {
        "id": "recImYiEBONPciSO5",
        "createdTime": "2022-03-12T17:41:09.000Z",
        "fields": {
            "Название": "КЖД",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2018-02-12"
        }
    },
    {
        "id": "recdT1YqmnG0xMrM4",
        "createdTime": "2022-03-17T07:14:43.000Z",
        "fields": {
            "Название": "Коза Ностра",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-02-25"
        }
    },
    {
        "id": "recM6djz83jZzezYJ",
        "createdTime": "2022-10-11T12:44:51.000Z",
        "fields": {
            "Название": "7 пределов",
            "Регистрация в Лиге": "2022-10-10"
        }
    },
    {
        "id": "recHXafGsDzW0Hbji",
        "createdTime": "2022-03-10T19:11:44.000Z",
        "fields": {
            "Название": "Комета",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-03-28"
        }
    },
    {
        "id": "recst39AJwl7Edi0c",
        "createdTime": "2022-03-05T19:04:20.000Z",
        "fields": {
            "Название": "Комус",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2020-02-10"
        }
    },
    {
        "id": "recUZ9IN2r9brYDa6",
        "createdTime": "2022-03-05T20:00:55.000Z",
        "fields": {
            "Название": "Коралл",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2019-04-03"
        }
    },
    {
        "id": "recuchsORYh1p8mL5",
        "createdTime": "2022-03-05T19:03:01.000Z",
        "fields": {
            "Название": "Крафт",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-08-17"
        }
    },
    {
        "id": "rec8bSClTVyMzftSd",
        "createdTime": "2022-03-12T17:39:45.000Z",
        "fields": {
            "Название": "Лас-Вегас",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2018-07-31"
        }
    },
    {
        "id": "receUzM5hTXJpSw7H",
        "createdTime": "2022-03-05T19:03:02.000Z",
        "fields": {
            "Название": "Легион",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-08-30"
        }
    },
    {
        "id": "recwdXiTwfieWJ2zl",
        "createdTime": "2022-03-05T19:04:28.000Z",
        "fields": {
            "Название": "Легион-2",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2018-07-10"
        }
    },
    {
        "id": "recQDvGEzaH7MRNPl",
        "createdTime": "2022-03-17T06:45:32.000Z",
        "fields": {
            "Название": "Лемниската",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-10-04"
        }
    },
    {
        "id": "rec0yMKHYH64GWmVb",
        "createdTime": "2022-03-05T19:03:06.000Z",
        "fields": {
            "Название": "Лукулл",
            "Город": "Андреевка",
            "Регистрация в Лиге": "2021-10-03"
        }
    },
    {
        "id": "reca5NQVSKm3gmn8C",
        "createdTime": "2022-03-05T19:04:27.000Z",
        "fields": {
            "Название": "Матчбол",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-02-19"
        }
    },
    {
        "id": "recUlGFNaYF1oF4Ty",
        "createdTime": "2022-03-17T06:46:42.000Z",
        "fields": {
            "Название": "Матчбол (дети)",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-04-29"
        }
    },
    {
        "id": "recyw2f145WAJGLGx",
        "createdTime": "2022-03-05T19:03:15.000Z",
        "fields": {
            "Название": "Медведи",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2021-02-22"
        }
    },
    {
        "id": "recYnoo44jhdEfcs7",
        "createdTime": "2022-03-09T20:37:17.000Z",
        "fields": {
            "Название": "Метеор",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2019-03-17"
        }
    },
    {
        "id": "recEfoxitVwTxOTBa",
        "createdTime": "2022-03-16T18:34:12.000Z",
        "fields": {
            "Название": "Миг",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-01-18"
        }
    },
    {
        "id": "rec8BwgNp8nnHt1kw",
        "createdTime": "2022-03-05T19:04:39.000Z",
        "fields": {
            "Название": "Молния",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-08-31"
        }
    },
    {
        "id": "recHVsqG4OAwf4ekI",
        "createdTime": "2022-03-13T18:08:14.000Z",
        "fields": {
            "Название": "Море",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-03-02"
        }
    },
    {
        "id": "recrMY3m9FkkZRWyv",
        "createdTime": "2022-03-09T12:21:40.000Z",
        "fields": {
            "Название": "Мрия",
            "Город": "Ялта",
            "Регистрация в Лиге": "2019-11-12"
        }
    },
    {
        "id": "recf5jCoQc4ebLckG",
        "createdTime": "2022-03-05T19:04:13.000Z",
        "fields": {
            "Название": "Мстители",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2018-08-26"
        }
    },
    {
        "id": "recot7x19Vc6h0Pko",
        "createdTime": "2022-03-14T18:20:03.000Z",
        "fields": {
            "Название": "Муссон",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-05-22"
        }
    },
    {
        "id": "reche4L2VLav89gU5",
        "createdTime": "2022-08-22T09:02:12.000Z",
        "fields": {
            "Название": "Некома",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "rec2CY1r1ueUQNGiy",
        "createdTime": "2022-03-16T17:55:09.000Z",
        "fields": {
            "Название": "Неуловимые",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-03-02"
        }
    },
    {
        "id": "recU6624kYXUfdV82",
        "createdTime": "2022-03-10T18:42:04.000Z",
        "fields": {
            "Название": "Олимп",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2018-08-29"
        }
    },
    {
        "id": "recoXc9lMlrWdFoOg",
        "createdTime": "2022-08-22T09:02:33.000Z",
        "fields": {
            "Название": "Омега",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "rec4KbD8N7XB3hmEA",
        "createdTime": "2022-03-05T19:04:38.000Z",
        "fields": {
            "Название": "Оникс",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2021-08-14"
        }
    },
    {
        "id": "reccTk7ZsJZ7SiUWX",
        "createdTime": "2022-03-05T19:04:48.000Z",
        "fields": {
            "Название": "Орион",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "rec3B6xl26WIjT9uX",
        "createdTime": "2022-03-09T13:10:48.000Z",
        "fields": {
            "Название": "Орлы",
            "Город": "Орлиное",
            "Регистрация в Лиге": "2021-02-04"
        }
    },
    {
        "id": "recc8PkfQSTRuAKZg",
        "createdTime": "2022-08-22T09:11:01.000Z",
        "fields": {
            "Название": "Ортус",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2022-08-12"
        }
    },
    {
        "id": "recqwK3m9RaQjvfwe",
        "createdTime": "2022-07-01T13:28:53.000Z",
        "fields": {
            "Название": "Парадокс",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-07-01"
        }
    },
    {
        "id": "recQNpKlpeMTN4yzz",
        "createdTime": "2022-03-09T12:21:29.000Z",
        "fields": {
            "Название": "Прибой",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-01-03"
        }
    },
    {
        "id": "recUdDhsqd0WU5Hgo",
        "createdTime": "2022-03-05T19:03:15.000Z",
        "fields": {
            "Название": "Продвижение",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2020-09-12"
        }
    },
    {
        "id": "recHubc9y6vkPtnc6",
        "createdTime": "2022-03-11T18:52:12.000Z",
        "fields": {
            "Название": "Пьяный мачо",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2018-02-24"
        }
    },
    {
        "id": "rec9HmVM1YlrsaUR6",
        "createdTime": "2022-08-22T09:25:26.000Z",
        "fields": {
            "Название": "Хром",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "recCJ2XlRFNpPprcy",
        "createdTime": "2022-03-13T19:01:50.000Z",
        "fields": {
            "Название": "Равелин",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-03-11"
        }
    },
    {
        "id": "recMPmbwQFBKGVSoM",
        "createdTime": "2022-03-04T19:19:26.000Z",
        "fields": {
            "Название": "Ралли-поинт",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2018-02-21"
        }
    },
    {
        "id": "recxx0ELRBmt2lYoH",
        "createdTime": "2022-03-04T19:19:26.000Z",
        "fields": {
            "Название": "Рейнджерс",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-02-04"
        }
    },
    {
        "id": "recRTkl7DeiF8iuDA",
        "createdTime": "2022-03-05T19:58:23.000Z",
        "fields": {
            "Название": "Рестарт",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-08-12"
        }
    },
    {
        "id": "recOag26pggKOHil7",
        "createdTime": "2022-03-09T12:21:21.000Z",
        "fields": {
            "Название": "Сатурн",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2020-12-02"
        }
    },
    {
        "id": "recZWHISjWgw3LKeE",
        "createdTime": "2022-03-09T18:52:07.000Z",
        "fields": {
            "Название": "СевГУ",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-09-25"
        }
    },
    {
        "id": "recfWkK0Y8fnNt9jB",
        "createdTime": "2022-03-13T18:17:07.000Z",
        "fields": {
            "Название": "Северный Крым",
            "Город": "Армянск",
            "Регистрация в Лиге": "2018-02-15"
        }
    },
    {
        "id": "recBojBxkTur83Xue",
        "createdTime": "2022-03-13T18:17:00.000Z",
        "fields": {
            "Название": "Скворцово",
            "Город": "Скворцово",
            "Регистрация в Лиге": "2017-07-06"
        }
    },
    {
        "id": "recV5nUenQAEGrXcU",
        "createdTime": "2022-03-05T19:04:20.000Z",
        "fields": {
            "Название": "Спарта",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-03-13"
        }
    },
    {
        "id": "rec8ZHRbPI4NNyGfL",
        "createdTime": "2022-08-22T09:01:39.000Z",
        "fields": {
            "Название": "Сплин",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "recPy6C3e4s2FjEfk",
        "createdTime": "2022-03-10T14:54:20.000Z",
        "fields": {
            "Название": "Ставрос",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-03-08"
        }
    },
    {
        "id": "recWQIQa0QT0cgGOX",
        "createdTime": "2022-03-13T18:17:19.000Z",
        "fields": {
            "Название": "Сталь",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2018-02-19"
        }
    },
    {
        "id": "recMYX0UQ505TwwQL",
        "createdTime": "2022-03-05T19:03:22.000Z",
        "fields": {
            "Название": "Стрела",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "rec1LlcSbQvXrMdVz",
        "createdTime": "2022-03-17T06:42:40.000Z",
        "fields": {
            "Название": "Стримерс",
            "Город": "Ялта",
            "Регистрация в Лиге": "2016-10-15"
        }
    },
    {
        "id": "rec5g7Qm8OJdaZ0QP",
        "createdTime": "2022-03-10T18:52:29.000Z",
        "fields": {
            "Название": "Строммонтаж",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2019-07-19"
        }
    },
    {
        "id": "rectlFHt9jokhoEon",
        "createdTime": "2022-03-05T19:03:32.000Z",
        "fields": {
            "Название": "Сурож",
            "Город": "Судак",
            "Регистрация в Лиге": "2019-08-19"
        }
    },
    {
        "id": "recrI01kZ8dsa6S9v",
        "createdTime": "2022-03-16T17:53:13.000Z",
        "fields": {
            "Название": "СЭГИ КФУ",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-03-03"
        }
    },
    {
        "id": "recnMQ0HqbVRluJAQ",
        "createdTime": "2022-03-09T13:08:50.000Z",
        "fields": {
            "Название": "Таврида",
            "Город": "Армянск",
            "Регистрация в Лиге": "2020-02-12"
        }
    },
    {
        "id": "recFG1XtmjZwIqpOS",
        "createdTime": "2022-03-14T20:35:13.000Z",
        "fields": {
            "Название": "Таврида (женская)",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-01-06"
        }
    },
    {
        "id": "recVLMP36y7NzwTFk",
        "createdTime": "2022-03-05T19:05:05.000Z",
        "fields": {
            "Название": "Таврия",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2022-02-01"
        }
    },
    {
        "id": "recg5aK1qELfZHGAI",
        "createdTime": "2022-03-11T18:51:59.000Z",
        "fields": {
            "Название": "Тайм-аут",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-10-24"
        }
    },
    {
        "id": "rec1f4pWJIfmahxXw",
        "createdTime": "2022-03-17T06:44:14.000Z",
        "fields": {
            "Название": "Танцуем",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-08-27"
        }
    },
    {
        "id": "recwRIDRji0gaA92X",
        "createdTime": "2022-08-22T09:03:05.000Z",
        "fields": {
            "Название": "Домино",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "recjKgVM6oyPiL6qY",
        "createdTime": "2022-03-13T18:16:43.000Z",
        "fields": {
            "Название": "Фаворит",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-02-25"
        }
    },
    {
        "id": "recf250FTNrYDDMjU",
        "createdTime": "2022-03-09T20:39:17.000Z",
        "fields": {
            "Название": "Факел",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2019-08-07"
        }
    },
    {
        "id": "recDW0rGE2H1vYf5o",
        "createdTime": "2022-03-14T18:24:39.000Z",
        "fields": {
            "Название": "Факел (СевГУ)",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-03-26"
        }
    },
    {
        "id": "recoWmhWBQWh2jzRL",
        "createdTime": "2022-08-22T09:04:24.000Z",
        "fields": {
            "Название": "ФВМ+1",
            "Город": "Краснодар",
            "Регистрация в Лиге": "2022-08-09"
        }
    },
    {
        "id": "recq7xUDdmjx5Ngal",
        "createdTime": "2022-03-05T19:03:41.000Z",
        "fields": {
            "Название": "Феникс",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-02-20"
        }
    },
    {
        "id": "recoxDWSilIUvaZ7y",
        "createdTime": "2022-03-16T17:56:52.000Z",
        "fields": {
            "Название": "Форсаж",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-02-28"
        }
    },
    {
        "id": "recfAzJCXqSvpCNy5",
        "createdTime": "2022-03-14T20:36:41.000Z",
        "fields": {
            "Название": "Фортем",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2017-01-20"
        }
    },
    {
        "id": "recmS8BgTWn8QIpqc",
        "createdTime": "2022-03-05T19:03:41.000Z",
        "fields": {
            "Название": "Циркон",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2020-08-06"
        }
    },
    {
        "id": "recBpK5dYCD9rugER",
        "createdTime": "2022-03-05T19:04:06.000Z",
        "fields": {
            "Название": "Черноморец",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2020-07-31"
        }
    },
    {
        "id": "recnTZ9QZUryBmf7E",
        "createdTime": "2022-03-05T19:04:28.000Z",
        "fields": {
            "Название": "Черноморец-2",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-08-20"
        }
    },
    {
        "id": "recXu7MPHQpXpp5s1",
        "createdTime": "2022-08-22T09:08:28.000Z",
        "fields": {
            "Название": "Черноморец-3",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-08-12"
        }
    },
    {
        "id": "recmfw38VhgmGHSxC",
        "createdTime": "2022-03-05T19:03:48.000Z",
        "fields": {
            "Название": "ЧНГ",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2016-03-14"
        }
    },
    {
        "id": "rec5bpX1gX6m9koGz",
        "createdTime": "2022-08-22T09:11:33.000Z",
        "fields": {
            "Название": "Шторм",
            "Город": "Ленино",
            "Регистрация в Лиге": "2022-08-19"
        }
    },
    {
        "id": "reccEe7SloEGYhD9e",
        "createdTime": "2022-03-05T20:00:37.000Z",
        "fields": {
            "Название": "Штурм",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2020-11-04"
        }
    },
    {
        "id": "recrlWD64QAqzpZ9O",
        "createdTime": "2022-03-07T20:46:17.000Z",
        "fields": {
            "Название": "ЭкоПик",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2021-08-11"
        }
    },
    {
        "id": "recuv3dt4fY8BkmHd",
        "createdTime": "2022-03-14T20:35:36.000Z",
        "fields": {
            "Название": "Эллада",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2017-07-18"
        }
    },
    {
        "id": "rec9GbvD9xEOe7ksG",
        "createdTime": "2022-08-22T09:08:08.000Z",
        "fields": {
            "Название": "Энель",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2022-08-11"
        }
    },
    {
        "id": "recs2aoqPQzqGzRBV",
        "createdTime": "2022-03-16T18:00:50.000Z",
        "fields": {
            "Название": "Энергия",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-08-28"
        }
    },
    {
        "id": "rec2hQpJTPt5WSRZf",
        "createdTime": "2022-03-05T19:03:49.000Z",
        "fields": {
            "Название": "ЮБК",
            "Город": "Ялта",
            "Регистрация в Лиге": "2020-02-23"
        }
    },
    {
        "id": "recge77Pl0RuEo8PL",
        "createdTime": "2022-03-16T18:17:46.000Z",
        "fields": {
            "Название": "Юность",
            "Город": "Симферополь",
            "Регистрация в Лиге": "2022-03-22"
        }
    },
    {
        "id": "recrOngXZfv51zxj6",
        "createdTime": "2022-07-01T13:28:39.000Z",
        "fields": {
            "Название": "Юность",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2022-07-01"
        }
    },
    {
        "id": "rechXlMaomM5dWYNV",
        "createdTime": "2022-03-09T20:37:03.000Z",
        "fields": {
            "Название": "Юпитер",
            "Город": "Севастополь",
            "Регистрация в Лиге": "2016-02-24"
        }
    },
    {
        "id": "rec9fTv7q8qCkzQXW",
        "createdTime": "2022-03-13T18:48:11.000Z",
        "fields": {
            "Название": "Ялта",
            "Город": "Ялта",
            "Регистрация в Лиге": "2018-02-12"
        }
    },
    {
        "id": "recqIf04vpEeVqngL",
        "createdTime": "2022-03-05T20:01:11.000Z",
        "fields": {
            "Название": "Ялта Горгаз",
            "Город": "Ялта",
            "Регистрация в Лиге": "2020-10-15"
        }
    }
];